tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
// ==========================================================
// ===============   ESP32 SMART HOME (ALL IN ONE)  =========
// ==========================================================
// -------- THƯ VIỆN CẦN DÙNG --------
#include <Arduino.h>
#include <EEPROM.h>           // EEPROM (bộ nhớ không mất khi mất điện) lưu SSID/PASS
#include <ArduinoJson.h>      // JSON (định dạng dữ liệu key-value)
#include <WiFi.h>             // WiFi cho ESP32
#include <WebServer.h>        // WebServer (máy chủ web chạy trên ESP32)
#include <Ticker.h>           // Ticker (timer định kỳ)
#include <ESP32Servo.h>       // Điều khiển Servo cho ESP32
#include <DHT.h>   // thư viện DHT (cảm biến nhiệt độ/độ ẩm)
#include <HTTPClient.h>  // HTTP client (thư viện gửi yêu cầu HTTP)
#include <Firebase_ESP_Client.h>  // Firebase cho ESP32
#include "addons/TokenHelper.h"   // Firebase token helper
#include "addons/RTDBHelper.h"    // Firebase Realtime Database helper

// Tạo WebServer chạy port 80 (HTTP)
WebServer webServer(80);
Ticker blinker;
// ==== LED PINS ====
const int led1 = 14;
const int led2 = 27;
const int led3 = 26;
const int led4 = 25;
const int led5 = 33;

// ==== TRẠNG THÁI LED ====
bool led1State = false;
bool led2State = false;
bool led3State = false;
bool led4State = false;
bool led5State = false;

// ==== SERVO ====
Servo gateServo;
const int SERVO_PIN = 32;
int servoAngle = 0;
const int SERVO_CLOSED_ANGLE = 0;
const int SERVO_OPENED_ANGLE = 180;
bool doorOpen = false;

// ==== DHT / NHIỆT ĐỘ – ĐỘ ẨM ====
#define DHTPIN 4
#define DHTTYPE DHT11
DHT dht(DHTPIN, DHTTYPE);
float currentTempC = NAN;   // nhiệt độ hiện tại (°C – degree Celsius)
float currentHum   = NAN;   // độ ẩm hiện tại (% – humidity)


unsigned long lastTempRead = 0;  // lưu lần đọc nhiệt độ gần nhất (ms)
// ==========================================================
// ===============   WIFI CONFIG (GỘP TỪ wifiConfig.h)  =====
// ==========================================================

String ssid;
String password;
#define ledPin 2        // LED trạng thái WiFi
#define btnPin 0        // Nút nhấn reset WiFi (giữ 5s)
unsigned long lastTimePress = millis();
#define PUSHTIME 5000   // 5 giây
int wifiMode;           // 0: cấu hình, 1: đã kết nối, 2: mất WiFi
unsigned long blinkTime = millis();

// ===== FIREBASE CONFIG =====
#define FIREBASE_HOST "iot-smarthome-998dc-default-rtdb.asia-southeast1.firebasedatabase.app"
#define FIREBASE_AUTH "AIzaSyDmV5OjJyKScIxkwVZnoeob4l4KXcdEQdw"
#define FB_BASE_PATH  "/esp32_1"

// Firebase objects
FirebaseData fbdo;
FirebaseAuth auth;
FirebaseConfig config;

// ===== STATIC IP CONFIG (Comment để dùng DHCP - Bỏ comment để dùng IP cố định) =====
// IPAddress staticIP(192, 168, 1, 100);    // IP cố định cho ESP32
// IPAddress gateway(192, 168, 1, 1);       // Gateway của router
// IPAddress subnet(255, 255, 255, 0);      // Subnet mask
// IPAddress primaryDNS(8, 8, 8, 8);        // DNS chính (Google)
// IPAddress secondaryDNS(8, 8, 4, 4);      // DNS phụ (Google)


// Trang web cấu hình WiFi (AP mode)
const char wifiConfigHtml[] PROGMEM = R"html(
  <!DOCTYPE html>
    <html>
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <title>SETTING WIFI INFORMATION</title>
        <style type="text/css">
          body{display: flex;justify-content: center;align-items: center;}
          button{width: 135px;height: 40px;margin-top: 10px;border-radius: 5px}
          label, span{font-size: 25px;}
          input{margin-bottom: 10px;width:275px;height: 30px;font-size: 17px;}
          select{margin-bottom: 10px;width: 280px;height: 30px;font-size: 17px;}
        </style>
    </head>
    <body>
      <div>
        <h3 style="text-align: center;">SETTING WIFI INFORMATION</h3>
        <p id="info" style="text-align: center;">Scanning wifi network...!</p>
        <label>Wifi name:</label><br>
        <select id="ssid">
          <option>Choise wifi name!</option>
        </select><br>
        <label>Password:</label><br>
        <input id="password" type="text"><br>

        <button onclick="saveWifi()" style="background-color: cyan;margin-right: 10px">SAVE</button>
        <button onclick="reStart()" style="background-color: pink;">RESTART</button>
      </div>
        <script type="text/javascript">
          window.onload=function(){
            scanWifi();
          }
          var xhttp = new XMLHttpRequest();
          function scanWifi(){
            xhttp.onreadystatechange = function(){
              if(xhttp.readyState==4&&xhttp.status==200){
                data = xhttp.responseText;
                document.getElementById("info").innerHTML = "WiFi scan completed!"
                var obj = JSON.parse(data);
                var select = document.getElementById("ssid");
                for(var i=0; i<obj.length;++i){
                  select[select.length] = new Option(obj[i],obj[i]);
                }
              }
            }
            xhttp.open("GET","/scanWifi",true);
            xhttp.send();
          }
          function saveWifi(){
            ssid = document.getElementById("ssid").value;
            pass = document.getElementById("password").value;
            xhttp.onreadystatechange = function(){
              if(xhttp.readyState==4&&xhttp.status==200){
                data = xhttp.responseText;
                alert(data);
              }
            }
            xhttp.open("GET","/saveWifi?ssid="+ssid+"&pass="+pass,true);
            xhttp.send();
          }
          function reStart(){
            xhttp.onreadystatechange = function(){
              if(xhttp.readyState==4&&xhttp.status==200){
                data = xhttp.responseText;
                alert(data);
              }
            }
            xhttp.open("GET","/reStart",true);
            xhttp.send();
          }
        </script>
    </body>
  </html>
)html";

// Nháy LED theo thời gian t (ms)
void blinkLed(uint32_t t){
  if(millis() - blinkTime > t){
    digitalWrite(ledPin, !digitalRead(ledPin));
    blinkTime = millis();
  }
}

// Điều khiển LED trạng thái theo wifiMode & nút
void ledControl(){
  if(digitalRead(btnPin) == LOW){
    if(millis() - lastTimePress < PUSHTIME){
      blinkLed(1000);
    }else{
      blinkLed(50);
    }
  }else{
    if(wifiMode == 0){
      blinkLed(50);
    }else if(wifiMode == 1){
      blinkLed(3000);
    }else if(wifiMode == 2){
      blinkLed(300);
    }
  }
}

// Đặt góc servo tùy ý, kiểu: /gate_angle?val=90
void handleGateAngle() {
  if (!webServer.hasArg("val")) {
    webServer.send(400, "text/plain", "Missing 'val'");
    return;
  }
  int angle = webServer.arg("val").toInt();  // toInt (chuyển sang số)
  angle = constrain(angle, 0, 180);          // constrain (giới hạn) trong [0,180]

  servoAngle = angle;
  gateServo.write(servoAngle);

  // Cập nhật trạng thái cửa dựa trên góc
  // (nếu >90 coi như "mở", tùy bạn chỉnh ngưỡng)
  doorOpen = (servoAngle > 45);

  webServer.send(200, "text/plain", "OK");
}

// ==== HÀM SỰ KIỆN WIFI (tương thích core cũ & mới) ====
void WiFiEvent(
  #if defined(ARDUINO_EVENT_MAX) || defined(ARDUINO_EVENT_WIFI_READY)
    arduino_event_id_t event
  #else
    WiFiEvent_t event
  #endif
) {
  switch (event) {
    // Khi STA nhận IP thành công
    #ifdef ARDUINO_EVENT_WIFI_STA_GOT_IP
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    #endif
    #ifdef IP_EVENT_STA_GOT_IP
    case IP_EVENT_STA_GOT_IP:
    #endif
    #ifdef SYSTEM_EVENT_STA_GOT_IP
    case SYSTEM_EVENT_STA_GOT_IP:
    #endif
      Serial.println("Connected to WiFi");
      Serial.print("IP Address: ");
      Serial.println(WiFi.localIP());
      wifiMode = 1;
      break;

    // Khi STA mất kết nối
    #ifdef ARDUINO_EVENT_WIFI_STA_DISCONNECTED
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    #endif
    #ifdef WIFI_EVENT_STA_DISCONNECTED
    case WIFI_EVENT_STA_DISCONNECTED:
    #endif
    #ifdef SYSTEM_EVENT_STA_DISCONNECTED
    case SYSTEM_EVENT_STA_DISCONNECTED:
    #endif
      Serial.println("Disconnected from WiFi");
      wifiMode = 2;
      WiFi.reconnect();
      break;

    default:
      break;
  }
}

// Kết nối WiFi STA hoặc tạo AP nếu chưa có SSID
void setupWifi(){
  if(ssid != ""){
    Serial.println("Connecting to wifi...!");
    WiFi.mode(WIFI_STA);
    
    // ⚡ Chọn 1 trong 2 cách cấu hình IP:
    
    // CÁCH 1: STATIC IP - Bỏ comment 5 dòng dưới để dùng IP cố định
    // if (!WiFi.config(staticIP, gateway, subnet, primaryDNS, secondaryDNS)) {
    //   Serial.println("⚠️ Static IP configuration failed!");
    // } else {
    //   Serial.println("✅ Static IP configured: " + staticIP.toString());
    // }
    
    // CÁCH 2: DHCP - IP tự động (đang dùng)
    Serial.println("✅ Using DHCP (automatic IP)");
    
