tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
    WiFi.onEvent(WiFiEvent);
    WiFi.setAutoReconnect(true);
    WiFi.persistent(false);
    WiFi.begin(ssid.c_str(), password.c_str());
  }else{
    Serial.println("ESP32 wifi network created!");
    WiFi.mode(WIFI_AP);
    uint8_t macAddr[6];
    WiFi.softAPmacAddress(macAddr);
    String ssid_ap = "ESP32-" + String(macAddr[4],HEX) + String(macAddr[5],HEX);
    ssid_ap.toUpperCase();
    WiFi.softAP(ssid_ap.c_str());
    Serial.println("Access point name:" + ssid_ap);
    Serial.println("Web server access address:" + WiFi.softAPIP().toString());
    wifiMode = 0;
  }
}

// Cấu hình WebServer WiFi config + LED HTTP API
void setupWebServer(){
  // Trang cấu hình WiFi
  webServer.on("/", [](){
    webServer.send(200, "text/html", wifiConfigHtml);
  });

  // Scan WiFi
  webServer.on("/scanWifi", [](){
    Serial.println("Scanning wifi network...!");
    int wifi_nets = WiFi.scanNetworks(true, true);
    const unsigned long t = millis();
    while (wifi_nets < 0 && millis() - t < 10000){
      delay(20);
      wifi_nets = WiFi.scanComplete();
    }
    DynamicJsonDocument doc(200);
    for(int i = 0; i < wifi_nets; ++i){
      Serial.println(WiFi.SSID(i));
      doc.add(WiFi.SSID(i));
    }
    String wifiList;
    serializeJson(doc, wifiList);
    Serial.println("Wifi list: " + wifiList);
    webServer.send(200, "application/json", wifiList);
  });

  // Lưu WiFi vào EEPROM
  webServer.on("/saveWifi", [](){
    String ssid_temp = webServer.arg("ssid");
    String password_temp = webServer.arg("pass");
    Serial.println("SSID:" + ssid_temp);
    Serial.println("PASS:" + password_temp);
    EEPROM.writeString(0, ssid_temp);
    EEPROM.writeString(32, password_temp);
    EEPROM.commit();
    webServer.send(200, "text/plain", "Wifi has been saved!");
  });

  // Restart ESP32
  webServer.on("/reStart", [](){
    webServer.send(200, "text/plain", "Esp32 is restarting!");
    delay(3000);
    ESP.restart();
  });

  // ----- ROUTE điều khiển LED (HTTP GET) -----
  // PHÒNG KHÁCH
  webServer.on("/on1",  [](){
    digitalWrite(led1, HIGH);
    led1State = true;
    webServer.send(200,"text/plain","LED1 ON");
  });
  webServer.on("/off1", [](){
    digitalWrite(led1, LOW);
    led1State = false;
    webServer.send(200,"text/plain","LED1 OFF");
  });

  // PHÒNG NGỦ
  webServer.on("/on2",  [](){
    digitalWrite(led2, HIGH);
    led2State = true;
    webServer.send(200,"text/plain","LED2 ON");
  });
  webServer.on("/off2", [](){
    digitalWrite(led2, LOW);
    led2State = false;
    webServer.send(200,"text/plain","LED2 OFF");
  });

  // NHÀ BẾP
  webServer.on("/on3",  [](){
    digitalWrite(led3, HIGH);
    led3State = true;
    webServer.send(200,"text/plain","LED3 ON");
  });
  webServer.on("/off3", [](){
    digitalWrite(led3, LOW);
    led3State = false;
    webServer.send(200,"text/plain","LED3 OFF");
  });

  // NHÀ VỆ SINH
  webServer.on("/on4",  [](){
    digitalWrite(led4, HIGH);
    led4State = true;
    webServer.send(200,"text/plain","LED4 ON");
  });
  webServer.on("/off4", [](){
    digitalWrite(led4, LOW);
    led4State = false;
    webServer.send(200,"text/plain","LED4 OFF");
  });

  // PHÒNG LÀM VIỆC
  webServer.on("/on5",  [](){
    digitalWrite(led5, HIGH);
    led5State = true;
    webServer.send(200, "text/plain", "LED5 ON");
  });
  webServer.on("/off5", [](){
    digitalWrite(led5, LOW);
    led5State = false;
    webServer.send(200, "text/plain", "LED5 OFF");
  });

  webServer.begin();
}

// Xử lý nút nhấn để xóa EEPROM cấu hình WiFi
void checkButton(){
  if(digitalRead(btnPin) == LOW){
    Serial.println("Press and hold for 5 seconds to reset to default!");
    if(millis() - lastTimePress > PUSHTIME){
      for(int i = 0; i < 100; i++){
        EEPROM.write(i, 0);
      }
      EEPROM.commit();
      Serial.println("EEPROM memory erased!");
      delay(2000);
      ESP.restart();
    }
    delay(1000);
  }else{
    lastTimePress = millis();
  }
}

// Lớp Config quản lý WiFi + WebServer
class Config {
public:
  void begin(){
    pinMode(ledPin, OUTPUT);
    pinMode(btnPin, INPUT_PULLUP);
    blinker.attach_ms(50, ledControl);
    EEPROM.begin(100);

    char ssid_temp[32], password_temp[64];
    EEPROM.readString(0, ssid_temp, sizeof(ssid_temp));
    EEPROM.readString(32, password_temp, sizeof(password_temp));
    ssid = String(ssid_temp);
    password = String(password_temp);
    if(ssid != ""){
      Serial.println("Wifi name:" + ssid);
      Serial.println("Password:" + password);
    }
    setupWifi();
    setupWebServer();
  }

  void run(){
    checkButton();
    webServer.handleClient();  // xử lý HTTP request
  }
} wifiConfig;


// ==========================================================
// ===============   DASHBOARD HTML (SMART HOME)  ===========
// ==========================================================

const char DASHBOARD_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="vi">
<head>
  <meta charset="UTF-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1" />
  <title>Smart Home IoT - IUH</title>
  <style>
    * { box-sizing: border-box; margin: 0; padding: 0; }

    body {
      font-family: system-ui, -apple-system, BlinkMacSystemFont, "Segoe UI", sans-serif;
      background: #f3f4f6;
      color: #111827;
      margin: 0;
      overflow-x: hidden;
    }

    .page {
      min-height: 100vh;
      display: flex;
      flex-direction: column;
    }

    .page-inner {
      width: 100%;
      max-width: 1200px;
      margin: 0 auto;
      padding: 0 12px 24px;
      box-sizing: border-box;
    }

    /* ===== HEADER TRÊN ===== */
    .top-header {
      background: #ffffff;
      border-bottom: 3px solid #e5e7eb;
      padding: 10px 16px;
      display: flex;
      justify-content: center;
      align-items: center;
      gap: 16px;
    }

    .top-logo {
      height: 54px;
      width: auto;
    }

    .top-text {
      text-align: left;
    }

    .school-name {
      font-size: 1rem;
      font-weight: 700;
      color: #1f2937;
      text-transform: uppercase;
    }

