tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
    .project-name {
      font-size: 1rem;
      font-weight: 700;
      color: #b91c1c;
      text-transform: uppercase;
      margin-top: 2px;
    }

    .sub-line {
      font-size: 0.8rem;
      color: #4b5563;
      margin-top: 4px;
    }

    /* ===== LAYOUT DƯỚI ===== */
    .layout {
      flex: 1;
      display: flex;
      min-height: 0;
    }

    .sidebar {
      width: 220px;
      background: #ffffff;
      border-right: 1px solid #e5e7eb;
      padding: 16px 14px;
      display: flex;
      flex-direction: column;
      gap: 12px;
    }

    .nav-title {
      font-size: 0.8rem;
      letter-spacing: 0.08em;
      color: #6b7280;
      text-transform: uppercase;
      margin-bottom: 4px;
    }

    .nav-list {
      display: flex;
      flex-direction: column;
      gap: 6px;
    }

    .nav-item {
      display: flex;
      align-items: center;
      gap: 10px;
      padding: 8px 10px;
      border-radius: 999px;
      border: none;
      background: transparent;
      cursor: pointer;
      font-size: 0.9rem;
      color: #111827;
      text-align: left;
      transition: background 0.15s ease, transform 0.1s ease;
    }

    .nav-icon {
      width: 28px;
      height: 28px;
      border-radius: 999px;
      background: #e5e7eb;
      display: flex;
      align-items: center;
      justify-content: center;
      font-size: 1.1rem;
    }

    .nav-item:hover {
      background: #e5e7eb;
      transform: translateX(2px);
    }

    .nav-item.active {
      background: #16a34a;
      color: #ffffff;
    }

    .nav-item.active .nav-icon {
      background: #ffffff;
      color: #16a34a;
    }

    .sidebar-footer {
      margin-top: auto;
      font-size: 0.75rem;
      color: #6b7280;
    }

    .sidebar-footer strong {
      color: #111827;
    }

    /* ===== CONTENT ===== */
    .content {
      flex: 1;
      padding: 18px 20px;
      display: flex;
      flex-direction: column;
      gap: 14px;
    }

    .content-header {
      display: flex;
      justify-content: space-between;
      align-items: center;
      gap: 12px;
    }

    .content-title {
      font-size: 1.3rem;
      font-weight: 600;
      color: #111827;
    }

    .content-subtitle {
      font-size: 0.85rem;
      color: #6b7280;
      margin-top: 2px;
    }

    .badge {
      padding: 4px 10px;
      border-radius: 999px;
      font-size: 0.8rem;
      background: #e5e7eb;
      color: #111827;
    }
    .badge.online { color: #16a34a; }
    .badge.offline { color: #b91c1c; }

    .cards-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(260px, 1fr));
      gap: 16px;
      margin-top: 6px;
    }

    .card {
      background: #ffffff;
      border-radius: 14px;
      padding: 14px 16px;
      box-shadow: 0 8px 20px rgba(0,0,0,0.06);
      border: 1px solid #e5e7eb;
    }

    .card-title {
      display: flex;
      justify-content: space-between;
      align-items: center;
      margin-bottom: 10px;
      font-size: 0.9rem;
      color: #4b5563;
      font-weight: 500;
    }

    .pill {
      display: inline-flex;
      align-items: center;
      gap: 6px;
      padding: 4px 10px;
      border-radius: 999px;
      background: #f3f4f6;
      font-size: 0.75rem;
      color: #6b7280;
    }

    .dot {
      width: 8px;
      height: 8px;
      border-radius: 999px;
      background: #22c55e;
    }

    .card-main {
      font-size: 1.1rem;
      font-weight: 600;
      margin-bottom: 8px;
      color: #111827;
    }

    .card-desc {
      font-size: 0.8rem;
      color: #6b7280;
    }

    /* Icon nhỏ trong title */
    .card-title-icon {
      margin-right: 6px;
      font-size: 1.1rem;
      vertical-align: -2px;
    }

    /* Danh sách trạng thái từng đèn trên Dashboard */
    .light-list {
      list-style: none;
      margin: 6px 0 0 0;
      padding: 0;
    }

    .light-item {
      display: flex;
      align-items: center;
      font-size: 0.85rem;
      color: #4b5563;
      margin-top: 2px;
    }

    .light-dot {
      width: 8px;
      height: 8px;
      border-radius: 999px;
      background: #9ca3af; /* xám = tắt */
      margin-right: 6px;
    }

    .light-item.on .light-dot {
      background: #16a34a; /* xanh = bật */
    }

    .light-room {
      min-width: 120px;
      font-weight: 500;
      text-transform: uppercase;
      font-size: 0.78rem;
      color: #111827;
      margin-right: 6px;
    }

    /* Icon cho nhiệt độ & độ ẩm */
    .sensor-emoji {
      font-size: 1.2rem;
      margin-right: 4px;
      vertical-align: -2px;
    }

    .btn-row {
      display: flex;
      flex-wrap: wrap;
      gap: 8px;
      margin-top: 10px;
    }

    .btn {
      flex: 1;
      min-width: 90px;
      padding: 8px 10px;
      border-radius: 999px;
      border: none;
      font-size: 0.85rem;
      cursor: pointer;
      background: #e5e7eb;
      color: #111827;
      transition: background 0.15s ease, transform 0.1s ease, box-shadow 0.15s ease;
    }

    .btn-primary {
      background: #16a34a;
      color: #f9fafb;
      font-weight: 600;
      box-shadow: 0 8px 18px rgba(22,163,74,0.35);
    }

    .btn-danger {
      background: #dc2626;
      color: #fee2e2;
      font-weight: 600;
      box-shadow: 0 8px 18px rgba(220,38,38,0.35);
    }

    .btn:active {
      transform: scale(0.97);
      box-shadow: none;
    }

    .sensor-value {
      font-size: 1.7rem;
      font-weight: 700;
      color: #111827;
    }

    .sensor-unit {
      font-size: 0.9rem;
      color: #6b7280;
      margin-left: 4px;
    }

    .hidden {
      display: none;
    }

    .switch-row {
      display: flex;
      flex-wrap: wrap;
      gap: 10px;
      margin-top: 10px;
    }

    .switch {
      display: inline-flex;
      align-items: center;
      gap: 8px;
      font-size: 0.85rem;
      cursor: pointer;
      user-select: none;
    }

    .switch-label {
      min-width: 60px;
    }

    .switch-track {
      width: 44px;
      height: 22px;
      border-radius: 999px;
      background: #e5e7eb;
      position: relative;
      transition: background 0.15s ease;
    }

