tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
    .switch-thumb {
      position: absolute;
      top: 2px;
      left: 2px;
      width: 18px;
      height: 18px;
      border-radius: 999px;
      background: #ffffff;
      box-shadow: 0 1px 4px rgba(0,0,0,0.3);
      transition: transform 0.15s ease;
    }

    .switch.on .switch-track {
      background: #16a34a;
    }

    .switch.on .switch-thumb {
      transform: translateX(22px);
    }

    .view-title {
      font-size: 1.1rem;
      font-weight: 600;
      margin: 4px 0 10px;
    }

    @media (max-width: 768px) {
      .layout {
        flex-direction: column;
      }
      .sidebar {
        width: 100%;
        flex-direction: row;
        align-items: center;
        justify-content: space-between;
      }
      .sidebar-footer {
        display: none;
      }
      .nav-title {
        display: none;
      }
      .nav-list {
        flex-direction: row;
        gap: 4px;
      }
      .nav-item {
        font-size: 0.8rem;
        padding: 6px 8px;
      }
      .content {
        padding: 12px;
      }
    }
  </style>
</head>
<body>
  <div class="page">
    <header class="top-header">
      <img
        src="https://upload.wikimedia.org/wikipedia/commons/1/13/Logo_PTIT_University.png"
        alt="PTIT Logo"
        class="top-logo"
      />
      <div class="top-text">
        <div class="school-name">HỌC VIỆN CÔNG NGHỆ BƯU CHÍNH VIỄN THÔNG CƠ SỞ TP.HỒ CHÍ MINH</div>
        <div class="project-name">SMART HOME IoT</div>
        <div class="sub-line">Bảng điều khiển thiết bị thông minh dùng ESP32</div>
      </div>
    </header>

    <div class="layout">
      <!-- SIDEBAR -->
      <aside class="sidebar">
        <div>
          <div class="nav-title">Điều hướng</div>
          <div class="nav-list">
            <button class="nav-item active" onclick="showView('dashboard')">
              <div class="nav-icon">🏠</div>
              <span>Dashboard</span>
            </button>
            <button class="nav-item" onclick="showView('door')">
              <div class="nav-icon">🚪</div>
              <span>Cửa ra vào</span>
            </button>
            <button class="nav-item" onclick="showView('lights')">
              <div class="nav-icon">💡</div>
              <span>Đèn chiếu sáng</span>
            </button>
            <button class="nav-item" onclick="showView('sensor')">
              <div class="nav-icon">📡</div>
              <span>Cảm biến</span>
            </button>
          </div>
        </div>

        <div class="sidebar-footer">
          <div><strong>WiFi:</strong> local network</div>
          <div>Presented by 😄</div>
        </div>
      </aside>

      <!-- CONTENT -->
      <main class="content">
        <div class="content-header">
          <div>
            <div class="content-title">Smart Home Dashboard</div>
            <div class="content-subtitle">Giám sát & điều khiển thiết bị</div>
          </div>
          <div>
            <span id="wifi-badge" class="badge offline">WiFi: checking...</span>
          </div>
        </div>

        <!-- VIEW: DASHBOARD -->
        <section id="view-dashboard" class="view">
          <div class="cards-grid">
            <!-- Cửa -->
            <div class="card">
              <div class="card-title">
                <span><span class="card-title-icon">🚪</span>Cửa ra vào</span>
                <span class="pill" id="door-state-pill">Đang đóng</span>
              </div>
              <div class="card-main" id="door-state-text-dashboard">
                Cửa đang đóng
              </div>
              <div class="card-desc">
                Xem nhanh trạng thái cửa (mở / đóng). Điều khiển tại tab "Cửa ra vào".
              </div>
            </div>

            <!-- Đèn -->
            <div class="card">
              <div class="card-title">
                <span><span class="card-title-icon">💡</span>Đèn chiếu sáng</span>
                <span class="pill">5 kênh LED</span>
              </div>
              <div class="card-main" id="lights-summary">
                ...
              </div>
              <div class="card-desc">
                <ul class="light-list">
                  <li class="light-item" id="light-item-1">
                    <span class="light-dot"></span>
                    <span class="light-room">PHÒNG KHÁCH</span>
                    <span id="light-status-1">--</span>
                  </li>
                  <li class="light-item" id="light-item-2">
                    <span class="light-dot"></span>
                    <span class="light-room">PHÒNG NGỦ</span>
                    <span id="light-status-2">--</span>
                  </li>
                  <li class="light-item" id="light-item-3">
                    <span class="light-dot"></span>
                    <span class="light-room">NHÀ BẾP</span>
                    <span id="light-status-3">--</span>
                  </li>
                  <li class="light-item" id="light-item-4">
                    <span class="light-dot"></span>
                    <span class="light-room">NHÀ VỆ SINH</span>
                    <span id="light-status-4">--</span>
                  </li>
                  <li class="light-item" id="light-item-5">
                    <span class="light-dot"></span>
                    <span class="light-room">PHÒNG LÀM VIỆC</span>
                    <span id="light-status-5">--</span>
                  </li>
                </ul>
              </div>
            </div>

            <!-- Cảm biến nhiệt độ / độ ẩm -->
            <div class="card">
              <div class="card-title">
                <span><span class="card-title-icon">🌡</span>Cảm biến nhiệt độ / độ ẩm</span>
                <span class="pill">DHT11</span>
              </div>
              <div class="card-main">
                <span class="sensor-emoji">🌡</span>
                <span id="temp-val-dashboard" class="sensor-value">--</span>
                <span class="sensor-unit">°C</span>

                <span style="margin-left:20px;"></span>

