tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
                <span class="sensor-emoji">💧</span>
                <span id="hum-val-dashboard" class="sensor-value">--</span>
                <span class="sensor-unit">%</span>
              </div>
              <div class="card-desc" id="sensor-desc-dashboard">
                Đang đọc dữ liệu...
              </div>
            </div>

            <!-- Hệ thống -->
            <div class="card">
              <div class="card-title">
                <span>Hệ thống</span>
                <span class="pill">ESP32</span>
              </div>
              <div class="card-main" id="sys-status">Đang cập nhật...</div>
              <div class="card-desc" id="sys-extra">IP: đang đọc...</div>
            </div>
          </div>
        </section>

        <!-- VIEW: CỬA RA VÀO -->
        <section id="view-door" class="view hidden">
          <h2 class="view-title">Cửa ra vào</h2>
          <div class="card">
            <div class="card-title">
              <span>Điều khiển cửa</span>
              <span class="pill">
                Trạng thái: <span id="door-state-text">Đang đóng</span>
              </span>
            </div>

            <div class="card-main">
              Mở/đóng cửa bằng servo.
            </div>
            <div class="card-desc">
              Sử dụng nút hoặc kéo thanh trượt để đặt góc (0°–180°).
            </div>

            <!-- Nút mở / đóng nhanh -->
            <div class="btn-row" style="margin-top:8px;">
              <button class="btn btn-primary" onclick="gateOpen()">Mở cửa</button>
              <button class="btn btn-danger" onclick="gateClose()">Đóng cửa</button>
            </div>

            <!-- Thanh trượt góc servo -->
            <div style="margin-top:16px;">
              <label for="servo-slider" class="card-desc">
                Góc servo hiện tại:
                <strong><span id="servo-angle-text">0</span>°</strong>
              </label>
              <input
                id="servo-slider"
                type="range"
                min="0"
                max="180"
                value="0"
                oninput="onServoSliderChange(this.value)"
                style="width:100%; margin-top:8px;"
              />
              <div style="margin-top:4px; font-size:0.85rem;">
                Góc đang chọn: <span id="servo-slider-value">0</span>°
              </div>
            </div>
          </div>
        </section>

        <!-- VIEW: ĐÈN CHIẾU SÁNG -->
        <section id="view-lights" class="view hidden">
          <h2 class="view-title">Đèn chiếu sáng</h2>
          <div class="card">
            <div class="card-title">
              <span>Điều khiển đèn</span>
              <span class="pill">5 kênh LED</span>
            </div>
            <div class="card-main">
              Nút gạt bật/tắt đèn.
            </div>
            <div class="switch-row">
              <div class="switch" data-led="1" onclick="toggleLed(this)">
                <span class="switch-label">PHÒNG KHÁCH</span>
                <div class="switch-track"><div class="switch-thumb"></div></div>
              </div>
              <div class="switch" data-led="2" onclick="toggleLed(this)">
                <span class="switch-label">PHÒNG NGỦ</span>
                <div class="switch-track"><div class="switch-thumb"></div></div>
              </div>
              <div class="switch" data-led="3" onclick="toggleLed(this)">
                <span class="switch-label">NHÀ BẾP</span>
                <div class="switch-track"><div class="switch-thumb"></div></div>
              </div>
              <div class="switch" data-led="4" onclick="toggleLed(this)">
                <span class="switch-label">NHÀ VỆ SINH</span>
                <div class="switch-track"><div class="switch-thumb"></div></div>
              </div>
              <div class="switch" data-led="5" onclick="toggleLed(this)">
                <span class="switch-label">PHÒNG LÀM VIỆC</span>
                <div class="switch-track"><div class="switch-thumb"></div></div>
              </div>
            </div>
          </div>
        </section>

        <!-- VIEW: CẢM BIẾN -->
        <section id="view-sensor" class="view hidden">
          <h2 class="view-title">Cảm biến</h2>
          <div class="card">
            <div class="card-title">
              <span>Nhiệt độ & độ ẩm</span>
              <span class="pill">DHT11</span>
            </div>
            <div class="card-main">
              <div style="margin-bottom:8px;">
                <span class="sensor-emoji">🌡</span>
                <span id="temp-val-detail" class="sensor-value">--</span>
                <span class="sensor-unit">°C</span>
              </div>
              <div>
                <span class="sensor-emoji">💧</span>
                <span id="hum-val-detail" class="sensor-value">--</span>
                <span class="sensor-unit">%</span>
              </div>
            </div>
            <div class="card-desc" id="sensor-desc-detail">
              Đang đọc dữ liệu...
            </div>
          </div>
        </section>

      </main>
    </div>
  </div>

  <script>
    function showView(name) {
      var views = document.querySelectorAll(".view");
      for (var i = 0; i < views.length; i++) {
        views[i].style.display = "none";
      }
      var v = document.getElementById("view-" + name);
      if (v) v.style.display = "block";

      var items = document.querySelectorAll(".nav-item");
      for (var j = 0; j < items.length; j++) {
        items[j].classList.remove("active");
      }
      var current = null;
      for (var k = 0; k < items.length; k++) {
        var onclick = items[k].getAttribute("onclick") || "";
        if (onclick.indexOf("'" + name + "'") !== -1) {
          current = items[k];
          break;
        }
      }
      if (current) current.classList.add("active");
    }

    function led(idx, state) {
      var url = "";
      if (idx == 1) url = state ? "/on1" : "/off1";
      else if (idx == 2) url = state ? "/on2" : "/off2";
      else if (idx == 3) url = state ? "/on3" : "/off3";
      else if (idx == 4) url = state ? "/on4" : "/off4";
      else if (idx == 5) url = state ? "/on5" : "/off5";
      if (!url) return;
      fetch(url).catch(function(e){ console.log(e); });
    }

    function toggleLed(el) {
      var idx = parseInt(el.getAttribute("data-led"));
      if (!idx) return;
      var isOn = el.classList.contains("on");
      var newState = isOn ? 0 : 1;
      led(idx, newState);
    }

    function gateOpen() {
      fetch("/gate_open")
        .then(function(){
          var t = document.getElementById("door-state-text");
          if (t) t.innerText = "Đang mở";
        })
        .catch(function(e){ console.log(e); });
    }

    function gateClose() {
      fetch("/gate_close")
        .then(function(){
          var t = document.getElementById("door-state-text");
          if (t) t.innerText = "Đang đóng";
        })
        .catch(function(e){ console.log(e); });
    }

