tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
    function onServoSliderChange(val) {
      // cập nhật số bên cạnh thanh trượt
      var sliderVal = document.getElementById("servo-slider-value");
      if (sliderVal) sliderVal.innerText = val;

      // gửi lệnh lên ESP32
      fetch("/gate_angle?val=" + encodeURIComponent(val))
        .catch(function(e){ console.log(e); });
    }

    async function refreshStatus() {
      try {
        const res = await fetch("/api/status");
        if (!res.ok) throw new Error("Status HTTP error");
        const data = await res.json();

        // ----- WiFi badge -----
        const wifiBadge = document.getElementById("wifi-badge");
        if (wifiBadge) {
          if (data.wifi == 1) {
            wifiBadge.classList.remove("offline");
            wifiBadge.classList.add("online");
            wifiBadge.innerText = "WiFi: Online";
          } else {
            wifiBadge.classList.remove("online");
            wifiBadge.classList.add("offline");
            wifiBadge.innerText = "WiFi: Offline";
          }
        }

        // ----- Cửa -----
        const doorOpen = data.door_open == 1;
        const doorTextDash = document.getElementById("door-state-text-dashboard");
        const doorPill = document.getElementById("door-state-pill");
        const doorStateText = doorOpen ? "Đang mở" : "Đang đóng";

        if (doorTextDash) doorTextDash.innerText = "Cửa " + (doorOpen ? "đang mở" : "đang đóng");
        if (doorPill) doorPill.innerText = doorStateText;

        const doorText = document.getElementById("door-state-text");
        if (doorText) doorText.innerText = doorStateText;

        // ----- Servo angle (góc cửa) -----
        var angle = (data.servo_angle != null) ? data.servo_angle : 0;
        var angleText = document.getElementById("servo-angle-text");
        var slider = document.getElementById("servo-slider");
        var sliderValue = document.getElementById("servo-slider-value");

        if (angleText) angleText.innerText = angle;
        if (slider) slider.value = angle;
        if (sliderValue) sliderValue.innerText = angle;

        // ----- LED trạng thái tổng quát -----
        const leds = [data.led1, data.led2, data.led3, data.led4, data.led5];
        const onCount = leds.filter(function(x){ return x == 1; }).length;
        const lightsSummary = document.getElementById("lights-summary");
        if (lightsSummary) {
          lightsSummary.innerText = onCount === 0
            ? "Tất cả đèn đang tắt"
            : onCount + " đèn đang bật";
        }

        // Cập nhật switch theo state thật
        const switches = document.querySelectorAll(".switch");
        switches.forEach(function(sw){
          const idx = parseInt(sw.getAttribute("data-led"));
          if (!idx) return;
          const st = leds[idx - 1];
          if (st == 1) sw.classList.add("on");
          else sw.classList.remove("on");
        });

        // ----- Trạng thái chi tiết từng đèn trên Dashboard -----
        for (var i = 0; i < leds.length; i++) {
          var st = leds[i];
          var item = document.getElementById("light-item-" + (i + 1));
          var textEl = document.getElementById("light-status-" + (i + 1));
          if (item) {
            if (st == 1) item.classList.add("on");
            else item.classList.remove("on");
          }
          if (textEl) {
            textEl.innerText = (st == 1) ? "Đang bật" : "Đang tắt";
          }
        }

        // ----- Nhiệt độ + độ ẩm -----
        const t = data.temp_c;
        const h = data.hum;

        const tempDash = document.getElementById("temp-val-dashboard");
        const humDash = document.getElementById("hum-val-dashboard");
        const tempDetail = document.getElementById("temp-val-detail");
        const humDetail = document.getElementById("hum-val-detail");

        if (tempDash)   tempDash.innerText   = (t != null) ? t.toFixed(1) : "--";
        if (tempDetail) tempDetail.innerText = (t != null) ? t.toFixed(1) : "--";
        if (humDash)    humDash.innerText    = (h != null) ? h.toFixed(1) : "--";
        if (humDetail)  humDetail.innerText  = (h != null) ? h.toFixed(1) : "--";

        const sensorDescDash = document.getElementById("sensor-desc-dashboard");
        const sensorDescDetail = document.getElementById("sensor-desc-detail");
        const ok = (t != null) && (h != null);
        const msg = ok ? "Nhiệt độ & độ ẩm hiện tại." : "Không đọc được dữ liệu DHT11.";
        if (sensorDescDash) sensorDescDash.innerText = msg;
        if (sensorDescDetail) sensorDescDetail.innerText = msg;

        // ----- Hệ thống -----
        const statusText = data.wifi ? "Hệ thống hoạt động" : "WiFi chưa kết nối";
        const ipText = "IP: " + (data.ip || "N/A");
        const sysStatus = document.getElementById("sys-status");
        const sysExtra = document.getElementById("sys-extra");
        if (sysStatus) sysStatus.innerText = statusText;
        if (sysExtra)  sysExtra.innerText  = ipText;

      } catch (e) {
        console.log(e);
      }
    }

    setInterval(refreshStatus, 2000);
    refreshStatus();
    // đảm bảo lúc load lên đang ở dashboard
    showView('dashboard');
  </script>
</body>
</html>
)rawliteral";

float readTemperatureC() {
  float t = dht.readTemperature();   // đọc nhiệt độ (°C – degree Celsius)
  if (isnan(t)) return NAN;
  return t;
}

float readHumidity() {
  float h = dht.readHumidity();      // đọc độ ẩm (% – humidity)
  if (isnan(h)) return NAN;
  return h;
}

// Cập nhật cả nhiệt độ lẫn độ ẩm định kỳ
void updateTemperature() {
  float t = readTemperatureC();
  float h = readHumidity();

  if (!isnan(t)) {
    currentTempC = t;
  }
  if (!isnan(h)) {
    currentHum = h;
  }

  Serial.printf("DHT11 -> Temp: %.1f C, Hum: %.1f %%\n", currentTempC, currentHum);
}

// ====== FIREBASE FUNCTIONS ======
void initFirebase() {
  Serial.println("Initializing Firebase...");
  
  // Cấu hình Firebase
  config.host = FIREBASE_HOST;
  config.signer.tokens.legacy_token = FIREBASE_AUTH;
  
