tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
  // Khởi tạo Firebase
  Firebase.begin(&config, &auth);
  Firebase.reconnectWiFi(true);
  
  Serial.println("Firebase initialized!");
}

void syncStateToFirebase() {
  if (!Firebase.ready()) return;
  
  // Tạo JSON object
  FirebaseJson json;
  json.set("led1", led1State ? 1 : 0);
  json.set("led2", led2State ? 1 : 0);
  json.set("led3", led3State ? 1 : 0);
  json.set("led4", led4State ? 1 : 0);
  json.set("led5", led5State ? 1 : 0);
  json.set("door_open", doorOpen ? 1 : 0);
  json.set("servo_angle", servoAngle);
  
  // Thêm sensor data
  if (!isnan(currentTempC)) {
    json.set("temp_c", currentTempC);
  }
  if (!isnan(currentHum)) {
    json.set("hum", currentHum);
  }
  
  // Thêm trạng thái WiFi và IP để web biết ESP32 online
  json.set("wifi", 1);
  json.set("ip", WiFi.localIP().toString());
  
  // Gửi lên Firebase
  if (Firebase.RTDB.updateNode(&fbdo, FB_BASE_PATH, &json)) {
    Serial.println("✅ Synced to Firebase");
  } else {
    Serial.println("❌ Firebase sync failed: " + fbdo.errorReason());
  }
}

void checkFirebaseCommands() {
  if (!Firebase.ready()) return;
  
  // Đọc lệnh từ Firebase /esp32_1/cmd
  String cmdPath = String(FB_BASE_PATH) + "/cmd";
  
  if (Firebase.RTDB.getJSON(&fbdo, cmdPath)) {
    FirebaseJson &json = fbdo.jsonObject();
    FirebaseJsonData jsonData;
    
    // Kiểm tra lệnh LED
    for (int i = 1; i <= 5; i++) {
      String ledKey = "led" + String(i);
      if (json.get(jsonData, ledKey)) {
        int value = jsonData.intValue;
        switch(i) {
          case 1: digitalWrite(led1, value); led1State = value; break;
          case 2: digitalWrite(led2, value); led2State = value; break;
          case 3: digitalWrite(led3, value); led3State = value; break;
          case 4: digitalWrite(led4, value); led4State = value; break;
          case 5: digitalWrite(led5, value); led5State = value; break;
        }
        Serial.printf("LED%d = %d\n", i, value);
      }
    }
    
    // Kiểm tra lệnh servo/door
    if (json.get(jsonData, "servo_angle")) {
      servoAngle = jsonData.intValue;
      gateServo.write(servoAngle);
      doorOpen = (servoAngle >= (SERVO_OPENED_ANGLE / 2));
      Serial.printf("Servo angle = %d\n", servoAngle);
    }
    
    // Xóa lệnh sau khi xử lý
    Firebase.RTDB.deleteNode(&fbdo, cmdPath);
    
    // Sync lại trạng thái
    syncStateToFirebase();
  }
}



// ====== ROUTE CHO DASHBOARD ======

// Trả về HTML dashboard
void handleDashboardPage() {
  webServer.send_P(200, "text/html", DASHBOARD_HTML);
}

// Trả về JSON trạng thái (WiFi, IP, cửa, nhiệt, 5 đèn)
void handleStatusApi() {
  float t = currentTempC;
  float h = currentHum;
  int wifi_ok = (WiFi.status() == WL_CONNECTED) ? 1 : 0;
  String ipStr = WiFi.localIP().toString();

  String json = "{";
  json += "\"wifi\":" + String(wifi_ok) + ",";
  json += "\"ip\":\"" + ipStr + "\",";
  json += "\"door_open\":" + String(doorOpen ? 1 : 0) + ",";
  json += "\"servo_angle\":" + String(servoAngle) + ",";   // thêm góc servo
  json += "\"led1\":" + String(led1State ? 1 : 0) + ",";
  json += "\"led2\":" + String(led2State ? 1 : 0) + ",";
  json += "\"led3\":" + String(led3State ? 1 : 0) + ",";
  json += "\"led4\":" + String(led4State ? 1 : 0) + ",";
  json += "\"led5\":" + String(led5State ? 1 : 0) + ",";

  if (!isnan(t)) json += "\"temp_c\":" + String(t, 1) + ",";
  else           json += "\"temp_c\":null,";

  if (!isnan(h)) json += "\"hum\":" + String(h, 1);
  else           json += "\"hum\":null";

  json += "}";

  webServer.send(200, "application/json", json);
}

// Điều khiển cửa bằng web
void handleGateOpen() {
  servoAngle = SERVO_OPENED_ANGLE;
  gateServo.write(servoAngle);
  doorOpen = true;
  webServer.send(200, "text/plain", "Gate opened");
}

void handleGateClose() {
  servoAngle = SERVO_CLOSED_ANGLE;
  gateServo.write(servoAngle);
  doorOpen = false;
  webServer.send(200, "text/plain", "Gate closed");
}

// Gửi trạng thái hiện tại lên Firebase
void firebaseUpdateState() {
  if (WiFi.status() != WL_CONNECTED) return;

  StaticJsonDocument<256> doc;

  doc["wifi"]        = 1;
  doc["door_open"]   = doorOpen ? 1 : 0;
  doc["servo_angle"] = servoAngle;
  doc["led1"]        = led1State ? 1 : 0;
  doc["led2"]        = led2State ? 1 : 0;
  doc["led3"]        = led3State ? 1 : 0;
  doc["led4"]        = led4State ? 1 : 0;
  doc["led5"]        = led5State ? 1 : 0;

  // Nhiệt độ
  if (isnan(currentTempC)) {
    doc["temp_c"] = nullptr;      // -> JSON: null
  } else {
    doc["temp_c"] = currentTempC; // -> JSON: số float
  }

  // Độ ẩm
  if (isnan(currentHum)) {
    doc["hum"] = nullptr;
  } else {
    doc["hum"] = currentHum;
  }

  doc["ip"] = WiFi.localIP().toString();

  String json;
  serializeJson(doc, json);

  String url = String("https://") + FIREBASE_HOST + FB_BASE_PATH + "/state.json";

  HTTPClient http;
  http.begin(url);
  http.addHeader("Content-Type", "application/json");
  int httpCode = http.PUT(json);   // PUT (ghi đè node /state)
  http.end();

  // Serial.printf("Firebase update: %d\n", httpCode);
}

// Đọc lệnh điều khiển từ Firebase
void firebaseReadCommands() {
  if (WiFi.status() != WL_CONNECTED) return;

  String url = String("https://") + FIREBASE_HOST + FB_BASE_PATH + "/cmd.json";

  HTTPClient http;
  http.setTimeout(2000);
  http.begin(url);

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    http.end();
    return;
  }

  String payload = http.getString();
  http.end();

  StaticJsonDocument<256> doc;
  if (deserializeJson(doc, payload) != DeserializationError::Ok) {
    return;
  }

  bool hadCommand = false;

  // LED 1–5
  if (doc.containsKey("led1")) {
    bool st = doc["led1"] == 1;
    digitalWrite(led1, st ? HIGH : LOW);
    led1State = st;
    hadCommand = true;
  }
  if (doc.containsKey("led2")) {
    bool st = doc["led2"] == 1;
    digitalWrite(led2, st ? HIGH : LOW);
    led2State = st;
    hadCommand = true;
  }
  if (doc.containsKey("led3")) {
    bool st = doc["led3"] == 1;
    digitalWrite(led3, st ? HIGH : LOW);
    led3State = st;
    hadCommand = true;
  }
  if (doc.containsKey("led4")) {
    bool st = doc["led4"] == 1;
    digitalWrite(led4, st ? HIGH : LOW);
    led4State = st;
    hadCommand = true;
  }
  if (doc.containsKey("led5")) {
    bool st = doc["led5"] == 1;
    digitalWrite(led5, st ? HIGH : LOW);
    led5State = st;
    hadCommand = true;
  }

  // Cửa
  if (doc.containsKey("door")) {
    int doorCmd = doc["door"];
    if (doorCmd == 1) {
      gateServo.write(SERVO_OPENED_ANGLE);
      servoAngle = SERVO_OPENED_ANGLE;
      doorOpen = true;
    } else if (doorCmd == 0) {
      gateServo.write(SERVO_CLOSED_ANGLE);
      servoAngle = SERVO_CLOSED_ANGLE;
      doorOpen = false;
    }
    hadCommand = true;
  }

