tlabgh/IOT_SmartHome/ESP32_Code/src/ESP32_SmartHome.cpp
  // Góc servo tuỳ ý
  if (doc.containsKey("servo_angle")) {
    int ang = constrain(int(doc["servo_angle"]), 0, 180);
    servoAngle = ang;
    gateServo.write(servoAngle);
    doorOpen = (servoAngle >= (SERVO_OPENED_ANGLE / 2));
    hadCommand = true;
  }

  // 🔥 Sau khi xử lý, nếu có lệnh → xoá /cmd
  if (hadCommand) {
    HTTPClient httpDel;
    String delUrl = String("https://") + FIREBASE_HOST + FB_BASE_PATH + "/cmd.json";
    httpDel.setTimeout(2000);
    httpDel.begin(delUrl);
    httpDel.sendRequest("DELETE", "");   // xoá node /cmd
    httpDel.end();
  }
}

// ==========================================================
// ======================== SETUP ===========================
// ==========================================================
void setup() {
  Serial.begin(115200);
  wifiConfig.begin();

  // route web
  webServer.on("/dashboard", handleDashboardPage);
  webServer.on("/api/status", handleStatusApi);
  webServer.on("/gate_open", handleGateOpen);
  webServer.on("/gate_close", handleGateClose);
  webServer.on("/gate_angle", handleGateAngle);

  pinMode(led1,OUTPUT);
  pinMode(led2,OUTPUT);
  pinMode(led3,OUTPUT);
  pinMode(led4,OUTPUT);
  pinMode(led5,OUTPUT);

  dht.begin();

  gateServo.setPeriodHertz(50);
  gateServo.attach(SERVO_PIN,500,2400);
  gateServo.write(SERVO_CLOSED_ANGLE);

  // khởi tạo lần đọc nhiệt độ đầu tiên
  lastTempRead = millis();

  Serial.println("ESP32 Server started!");
}
// ==========================================================
// ========================= LOOP ===========================
// ==========================================================
void loop() {
  // WiFi config + web local
  wifiConfig.run();

  // In IP đúng một lần và khởi tạo Firebase
  static bool ipShown = false;
  if (!ipShown && WiFi.status() == WL_CONNECTED) {
    Serial.print("ESP32 IP Address: ");
    Serial.println(WiFi.localIP());
    ipShown = true;
    
    // Khởi tạo Firebase sau khi kết nối WiFi
    initFirebase();
  }

  // Đọc nhiệt độ / độ ẩm (DHT11) mỗi 2 giây
  if (millis() - lastTempRead >= 2000) {
    lastTempRead = millis();
    updateTemperature();
  }

  // --- Firebase sync (đồng bộ Firebase) ---
  static unsigned long lastStatePush = 0;
  static unsigned long lastCmdPull   = 0;
  unsigned long now = millis();

  // 1) 5 giây đẩy trạng thái lên Firebase 1 lần
  if (now - lastStatePush >= 5000) {
    lastStatePush = now;
    syncStateToFirebase();
  }

  // 2) 1 giây đọc lệnh Firebase 1 lần
  if (now - lastCmdPull >= 1000) {
    lastCmdPull = now;
    checkFirebaseCommands();
  }
}


